In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("supershops.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
x = df.drop('Profit', axis=1)
y = df['Profit']

In [4]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [5]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [6]:
x2 = x.copy()

In [7]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

# Normalization

In [8]:
from sklearn.preprocessing import MinMaxScaler

In [9]:
m = MinMaxScaler() #feature_range=(0, 1)

In [10]:
df_mar_sp = m.fit(x[['Marketing Spend']]) #calculating
df_mar_sp

MinMaxScaler()

In [11]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [12]:
x['Marketing Spend'] = m.transform(x[['Marketing Spend']])

In [13]:
x['Marketing Spend'].head()

0    0.692617
1    0.983359
2    0.927985
3    0.873136
4    0.859438
Name: Marketing Spend, dtype: float64

In [14]:
x['Marketing Spend'] = m.fit_transform(x[['Marketing Spend']])
x.head(10)

   Marketing Spend  Administration  Transport     Area
0         0.692617       136897.80  471784.10    Dhaka
1         0.983359       151377.59  443898.53      Ctg
2         0.927985       101145.55  407934.54  Rangpur
3         0.873136       118671.85  383199.62    Dhaka
4         0.859438        91391.77  366168.42  Rangpur
5         0.797566        99814.71  362861.36    Dhaka
6         0.814128       147198.87  127716.82      Ctg
7         0.788018       145530.06  323876.68  Rangpur
8         0.729018       148718.95  311613.29    Dhaka
9         0.745906       108679.17  304981.62      Ctg

In [15]:
#Loop

In [16]:
x['Marketing Spend'].min()

0.0

In [17]:
x['Marketing Spend'].max()

1.0

# Apply normalization in first 3 cloumns

In [18]:
x[['Marketing Spend', 'Administration', 'Transport']]= m.fit_transform( x[['Marketing Spend', 'Administration', 'Transport']])
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

Alternative way for lager set. Suppose We have 1-115 columns then we could apply this way:

In [19]:
columns_to_normalize = range(0, 3) 

x.iloc[:, columns_to_normalize] = m.fit_transform(x.iloc[:, columns_to_normalize])

x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standard Scaler

In [20]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

In [21]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html

In [22]:
x2['Marketing Spend'].std()

45902.25648230753

In [23]:
x2['Marketing Spend'].mean()

73721.6156

#do manually without using function

In [24]:
columns_to_standardize = ['Marketing Spend', 'Administration', 'Transport']

for col in columns_to_standardize:
    mean = x2[col].mean()
    std = x2[col].std()
    x2[col] = (x2[col] - mean) / std
    
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.888889        0.555117   2.143079    Dhaka
1         1.936203        1.071924   1.910049      Ctg
2         1.736731       -0.720938   1.609511  Rangpur
3         1.539157       -0.095396   1.402811    Dhaka
4         1.489812       -1.069066   1.260487  Rangpur

In [25]:
x2[['Marketing Spend', 'Administration', 'Transport']]= scaler.fit_transform( x2[['Marketing Spend', 'Administration', 'Transport']])
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# Robust

In [26]:
from sklearn.preprocessing import RobustScaler

In [27]:
r_scaler =  RobustScaler()

In [28]:
x2[['Marketing Spend', 'Administration', 'Transport']]= r_scaler.fit_transform( x2[['Marketing Spend', 'Administration', 'Transport']])
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur

# Max Abs

In [29]:
from sklearn.preprocessing import MaxAbsScaler
abs_scaler = MaxAbsScaler()

In [30]:
x2[['Marketing Spend', 'Administration', 'Transport']]= abs_scaler.fit_transform( x2[['Marketing Spend', 'Administration', 'Transport']])
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.449332        0.198805   1.000000    Dhaka
1         0.970189        0.401556   0.891559      Ctg
2         0.870987       -0.301810   0.751702  Rangpur
3         0.772728       -0.056401   0.655513    Dhaka
4         0.748187       -0.438385   0.589283  Rangpur

# Log Transformation

In [31]:
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [32]:
columns_to_transform = ['Marketing Spend', 'Administration', 'Transport']

x2[columns_to_transform].isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
dtype: int64

In [33]:
x2.dropna(subset=columns_to_transform, inplace=True)

In [34]:
x2[columns_to_transform].isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
dtype: int64

In [35]:
for col in columns_to_transform:
    x2[col] = np.log(x2[col] + 1e-8) # '+ 1e-8' use it so that we could overcome from any nan value
x2.head(10)

   Marketing Spend  Administration     Transport     Area
0        -0.799992       -1.615430  1.000000e-08    Dhaka
1        -0.030264       -0.912408 -1.147838e-01      Ctg
2        -0.138129             NaN -2.854148e-01  Rangpur
3        -0.257828             NaN -4.223365e-01    Dhaka
4        -0.290102             NaN -5.288493e-01  Rangpur
5        -0.450443             NaN -5.509149e-01    Dhaka
6        -0.404940       -1.069896           NaN      Ctg
7        -0.477648       -1.140444 -8.560924e-01  Rangpur
8        -0.664474       -1.009698 -9.751677e-01    Dhaka
9        -0.607341             NaN -1.046001e+00      Ctg